#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.master: Refreshing state... [id=none]
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.data.aws_ecr_image.lambda_image: Reading...
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
aws_api_gateway_rest_api.this: Refreshing state... [id=d09uj3e9kh]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
aws_api_gateway_api_key.this: Refreshing state... [id=mwfvag0h0f]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
data.aws_ami.latest_amazon_linux: Reading...
module.inference.module.api_gateway.data.aws_caller_identity.current: Reading...
module.memory.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_availability_zones.available: Reading...
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:e99cd07421707a59a1a6bca09ef92181ee1c057c99a54a01f922a125483e8f35]
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
module.inference.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:f425969c42559658383fbdbff2c4a792fe08c67ac90ba0f05d3e698a45a2d175]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.memory.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:3104b0c4aa3400afc6f8b1fe042542b70a07a7470976d6dcc86b3474eb456184]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
data.aws_secretsmanager_secret.password: Reading...
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:f2b3a7581f225138c295dd343df221217f65a0a841477d8d63d85c05cec4d746]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
data.aws_ami.latest_amazon_linux: Read complete after 1s [id=ami-03c951bbe993ea087]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:f5eb83144e7f81acf0843e1f0d19df4de1ebd5fafb37768087d44a6656a7fe57]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
data.aws_secretsmanager_secret_version.password: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.inference.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=c30cce]
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.list_collections.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=i033qb]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
module.inference.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-c30cce-GET]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-c30cce-OPTIONS]
module.list_collections.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-d09uj3e9kh-i033qb-GET]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-d09uj3e9kh-i033qb-OPTIONS]
module.inference.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
module.list_collections.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-c30cce-OPTIONS-200]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-c30cce-OPTIONS]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-d09uj3e9kh-i033qb-OPTIONS]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-d09uj3e9kh-i033qb-OPTIONS-200]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-c30cce-OPTIONS-200]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-d09uj3e9kh-i033qb-OPTIONS-200]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
aws_instance.jumpbox: Refreshing state... [id=i-0cd5eadbd064719b1]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.list_collections.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-i033qb-GET]
module.inference.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-d09uj3e9kh-c30cce-GET]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
aws_api_gateway_deployment.this: Refreshing state... [id=fwife8]
aws_api_gateway_stage.this: Refreshing state... [id=ags-d09uj3e9kh-dev]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]
aws_api_gateway_usage_plan.this: Refreshing state... [id=jxe0z0]
aws_api_gateway_usage_plan_key.this: Refreshing state... [id=mwfvag0h0f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_account.this will be created
  + resource "aws_api_gateway_account" "this" {
      + api_key_version     = (known after apply)
      + cloudwatch_role_arn = (known after apply)
      + features            = (known after apply)
      + id                  = (known after apply)
      + throttle_settings   = (known after apply)
    }

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2024-02-20T13:17:02Z" -> (known after apply)
      ~ description   = "Deployment for 2024-02-20T13:17:01Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:446872271111:d09uj3e9kh/" -> (known after apply)
      ~ id            = "fwife8" -> (known after apply)
      ~ invoke_url    = "https://d09uj3e9kh.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "2024-02-20T13:17:01Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.this will be updated in-place
  ~ resource "aws_api_gateway_stage" "this" {
      ~ deployment_id         = "fwife8" -> (known after apply)
        id                    = "ags-d09uj3e9kh-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "apigateway.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-api-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "this"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                          + "logs:PutLogEvents",
                          + "logs:GetLogEvents",
                          + "logs:FilterLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:e05ddd125f335ee651076d15a1a4ca206c1edb82c58817266dea77a112bd8349" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:f425969c42559658383fbdbff2c4a792fe08c67ac90ba0f05d3e698a45a2d175"
      ~ last_modified                  = "2024-02-20T13:16:32.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:b8bbd18429a4daea7a933ce95b8f3c495afc55610085559776fcf02403fc344a" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:f5eb83144e7f81acf0843e1f0d19df4de1ebd5fafb37768087d44a6656a7fe57"
      ~ last_modified                  = "2024-02-20T13:16:33.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:9a442541a1f0f2114f31a8863ebfc69933c9cdc4b460b7acd168cdc427558232" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:f2b3a7581f225138c295dd343df221217f65a0a841477d8d63d85c05cec4d746"
      ~ last_modified                  = "2024-02-20T13:16:32.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:7888bb62dbb720f3629876d0986e17f2d511115eed2443b50adc8c286e7d403b" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:e99cd07421707a59a1a6bca09ef92181ee1c057c99a54a01f922a125483e8f35"
      ~ last_modified                  = "2024-02-20T13:16:32.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:44221ca3be9e0ec763db215189731aceb1b9034c546c94e9363fb94b4b38c6b8" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:3104b0c4aa3400afc6f8b1fe042542b70a07a7470976d6dcc86b3474eb456184"
      ~ last_modified                  = "2024-02-20T13:16:32.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 4 to add, 6 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*